Repository: Rundiz-WP/rundiz-downloads
Catalog: App/languages/rd-downloads-*.po
Languages: th

source: You can filter the log for each user by adding the %s query string as name and the user id as value to the URL.
th: คุณสามารถกรองบันทึกของแต่ละผู้ใช้โดยเพิ่ม query string %s เป็นชื่อและ id ผู้ใช้เป็นค่าของมันลงใน URL.

source: Example:
th: ตัวอย่าง:

source: You can also filter the log for each download item by adding the %s query string as name and the download id as value to the URL.
th: คุณสามารถกรองบันทึกสำหรับแต่ละรายการดาวน์โหลดโดยเพิ่ม query string %s เป็นชื่อและ id ดาวน์โหลดเป็นค่าของมันลงใน URL.

source: The filters can be combined together.
th: ตัวกรองสามารถนำมาใช้ด้วยกันได้.

source: Why am I unable to clear the logs?
th: ทำไมฉันไม่สามารถล้างบันทึกได้?

source: You have to be an %1$s or have %2$s capability to clear the logs.
th: คุณต้องเป็น %1$s หรือมีความสามารถ %2$s เพื่อจะล้างบันทึก.

source: Search
th: ค้นหา

source: You can filter user's download items by adding the %s query string as name and the user id as value to the URL.
th: คุณสามารถกรองดาวน์โหลดของแต่ละผู้ใช้โดยเพิ่ม query string %s เป็นชื่อและ id ผู้ใช้เป็นค่าลงใน URL.

source: To view downloads, user require %s capability.
th: การดูดาวน์โหลด ผู้ใช้ต้องมีความสามารถ %s.

source: To delete an uploaded file, user require %s capability.
th: การจะลบไฟล์, ผู้ใช้จะต้องมีหน้าที่ %s.

source: Users cannot edit other's download if they don't have %s capability.
th: ผู้ใช้ไม่สามารถแก้ไขของผู้อื่นได้ ถ้าหากไม่มีหน้าที่ %s.

source: Users cannot use bulk action to update GitHub if they don't connect to GitHub OAuth.
th: ผู้ใช้ไม่สามารถดำเนินการอัปเดต GitHub ครั้งละมากๆถ้าเขาไม่ได้เชื่อมต่อกับ GitHub OAuth.

source: To display download button, use this shortcode %1$s, the %2$s value have to replace with the %3$s. The attribute %4$s is always required.
th: การจะแสดงปุ่มดาวน์โหลด, ใช้ช็อตโค้ดนี้ %1$s, ค่า %2$s จะต้องถูกเปลี่ยนเป็น %3$s. แอตทริบิวท์ %4$s จะต้องกรอกเสมอ.

source: Additional attribute for shortcode
th: แอตทริบิวท์เพิ่มเติม

source: You can use any of the attributes above combine together to match condition in the template and display its value.
th: คุณสามารถใช้แอตทริบิวท์ใดๆด้วยกันก็ได้จากด้านบนเพื่อให้ตรงตามเงื่อนไขในเท็มเพลทแล้วแสดงค่าของมันออกมา.

source: These attributes will be working if the downloads element was set properly by the administrator.
th: แอตทริบิวท์เหล่านี้จะทำงานได้ถ้าหาก element ถูกตั้งค่าสมบูรณ์โดยผู้ดูแล.

source: Found total
th: พบทั้งหมด

source: Page %1$s of %2$s
th: หน้า %1$s จาก %2$s

source: Previous
th: ก่อนหน้า

source: Insert
th: เพิ่ม

source: Top Downloads
th: ดาวน์โหลดสูงสุด

source: Last 24 hours
th: 24 ชั่วโมงล่าสุด

source: Last 7 days
th: 7 วันล่าสุด

source: Last 30 days
th: 30 วันล่าสุด

source: All time
th: ตลอดเวลา

source: Manual update
th: อัปเดทด้วยตนเอง

source: There are total %d actions for this manual update, please continue step by step.
th: มีการทำงานทั้งหมด %d รายการสำหรับการอัปเดทด้วยตนเองนี้, โปรดดำเนินการไปทีละขั้นตอน.

source: You are running %1$s of %2$d.
th: คุณกำลังทำงาน %1$s จาก %2$d.

source: Start
th: เริ่ม

source: Forbidden
th: ไม่อนุญาต

source: Your user agent has been blocked by the administrator. Please contact an administrator for your help.
th: User agent ของคุณถูกบล็อคโดยผู้ดูแล. โปรดติดต่อผู้ดูแลเพื่อขอความช่วยเหลือ.

source: Your user agent: %s.
th: User agent ของคุณ: %s.

source: Match banned user agent: %s.
th: ตรงกับ user agent ที่ถูกแบน: %s.

source: Not found
th: ไม่พบ

source: The download you have requested could not be found, please verify your link again.
th: ไม่พบไฟล์ดาวน์โหลดที่คุณเรียก, โปรดตรวจสอบลิ้งค์อีกครั้ง.

source: Human verification
th: ตรวจสอบความเป็นมนุษย์

source: Please enter the form below. Sorry for the inconvenient.
th: โปรดกรอกฟอร์มด้านล่าง. ขออภัยในความไม่สะดวก.

source: Please skip this field.
th: โปรดข้ามฟิลด์นี้.

source: I'm human.
th: ฉันเป็นมนุษย์.

source: Continue to download
th: ดำเนินการต่อ
