Repository: Rundiz-WP/rundiz-downloads
Catalog: App/languages/rd-downloads-*.po
Languages: th

source: Download manager for WordPress that support GitHub auto update.
th: ระบบจัดการดาวน์โหลดสำหรับเวิร์ดเพราสที่รองรับการอัปเดทอัตโนมัติจาก GitHub.

source: Settings configuration file was not set.
th: ไม่ได้กำหนดไฟล์ตั้งค่า.

source: The HTML element for replace the %s shortcode.
th: HTML ที่จะแทนที่ช็อตโค้ด %s.

source: Default value is %s.
th: ค่าเดิมคือ %s.

source: Available shortcode attributes.
th: แอตทริบิวท์ช็อตโค้ดที่มี.

source: Set one or more of these attributes into shortcode to match condition in the template and display its value. The %s attribute is required.
th: กำหนดแอตทริบิวท์ลงในช็อตโค้ดเพื่อให้ตรงเงื่อนไขในเท็มเพลทแล้วแสดงผลของมันออกมา. ค่าแอตทริบิวท์ %s ต้องกรอก.

source: Placeholders for the text replacement.
th: ค่าแทนที่ข้อความ.

source: Placeholders for DB fields replacement.
th: ค่าแทนที่ข้อมูลในฐานข้อมูล.

source: Conditional template tag.
th: แท็กเท็มเพลทแบบเงื่อนไข.

source: You can use conditional template tag to check that shortcode attribute was set. Example:
th: คุณสามารถใช้เงื่อนไขในเท็มเพลทเพื่อตรวจว่าแอตทริบิวท์ของช็อตโค้ดนั้นถูกกำหนดมา. ตัวอย่าง:

source: You can also use conditional template tag to check that DB value was set. Example:
th: คุณสามารถใช้เงื่อนไขในเท็มเพลทเพื่อตรวจว่าข้อมูลจากฐานข้อมูลนั้นถูกกำหนดมา. ตัวอย่าง:

source: More advance example:
th: ตัวอย่างเพิ่มเติม:

source: Choose how the auto update works. Auto update on every release and commit can make your server slow, if you choose every release then it will work less.
th: เลือกว่าอัปเดทอัตโนมัติจะทำงานอย่างไร. อัปเดทอัตโนมัติทุกๆ release และ commit จะทำให้เซิร์ฟเวอร์ทำงานช้าลงได้, ถ้าคุณเลือกเฉพาะทุกๆ release มันจะทำงานน้อยกว่า.

source: To make the auto update works, please follow the instruction below to get %1$s and %2$s
th: การทำให้ระบบอัปเดตอัตโนมัติทำงาน, โปรดทำตามคำแนะนำด้านล่างเพื่อรับ %1$s และ %2$s

source: This plugin use GitHub OAuth to auto update, auto correct repository URL. This is a lot easier for manage many repositories webhook and support multiple user's repositories.
th: ปลั๊กอินนี้ใช้ GitHub OAuth เพื่ออัปเดตอัตโนมัติ, ปรับ URL อัตโนมัติ. นี่จะง่ายขึ้นสำหรับการจัดการ webhook ของ repository หลายๆรายการและรองรับผู้ใช้หลายคน.

source: To make these functions work, you have to register an OAuth application on GitHub for your website.
th: การจะให้ฟังก์ชั่นเหล่านี้ทำงาน, คุณต้องลงทะเบียนแอปพลิเคชัน OAuth บน GitHub สำหรับเว็บไซต์ของคุณ.

source: Go to %1$sGitHub.com%2$s website.
th: ไปยังเว็บไซต์ %1$sGitHub%2$s.

source: If you want to register an application for your organization, please go to your organization &gt; Settings &gt; Developer settings &gt; OAtuh apps and click on Register an application.
th: ถ้าคณต้องการลงทะเบียนแอปพลิเคชันสำหรับองค์กร, โปรดไปยังองค์กรของคุณ &gt; Settings &gt; Developer settings &gt; OAtuh apps แล้วคลิกที่ Register an application.

source: If you want to register an application for yourself, please go to your Settings &gt; Developer settings &gt; %1$sOAtuh apps%2$s and click on New OAuth app.
th: ถ้าคุณต้องการลงทะเบียนแอปพลิเคชันสำหรับคุณเอง(ส่วนตัว), โปรดไปยัง Settings &gt; Developer settings &gt; %1$sOAtuh apps%2$s แล้วคลิกที่ New OAuth app.

source: Enter your application data here and set %s for Homepage URL and Authorization callback URL.
th: กรอกข้อมูลแอปพลิเคชันที่นี่แล้วกำหนด %s Homepage URL และ Authorization callback URL.

source: Click on Register application button.
th: คลิกบนปุ่ม Register application.

source: Copy %1$s and %2$s to the form field above. You may add your logo in the OAuth application settings page.
th: คัดลอก %1$s และ %2$s ไปยังฟอร์มด้านบน. คุณอาจเพิ่มโลโก้ในหน้าตั้งค่า OAuth แอปพลิเคชัน.

source: Connect users with their GitHub
th: เชื่อมต่อผู้ใช้กับ GitHub ของพวกเขา

source: Your users who want to add the download data and using GitHub auto update, auto correct repository URL features must connect this website with their GitHub.
th: ผู้ใช้ของคุณที่ต้องการจะเพิ่มรายการดาวน์โหลดและใช้ความสามารถอัปเดตอัตโนมัติจาก GitHub, แก้ไข URL อัตโนมัติ จะต้องเชื่อมต่อเว็บไซต์นี้กับ GitHub ของพวกเขา.

source: Complete all the steps above and GitHub OAuth link will be appears.
th: ทำขั้นตอนด้านบนให้สำเร็จทั้งหมดแล้วลิ้งค์ GitHub OAuth จะปรากฏขึ้น.

source: Click on %1$sGitHub OAuth%2$s menu and follow instruction.
th: คลิกบนเมนู %1$sGitHub OAuth%2$s และทำตามคำแนะนำ.

source: General
th: ทั่วไป

source: Check this to use force download instead of redirect to file. (This will work with local file only.)
th: ติ๊กที่นี่เพื่อใช้บังคับดาวน์โหลดแทนที่จะเปลี่ยนเส้นทางไปยังไฟล์. (ใช้ได้เฉพาะไฟล์บนเซิร์ฟเวอร์นี้เท่านั้น.)

source: Default is no.
th: ค่าเดิมคือไม่.

source: Yes
th: ใช่

source: Force download
th: บังคับดาวน์โหลด

source: Clear cache
th: ล้างแคช

source: If something seems not up-to-date, please try to clear the cache first. This will be clear all plugin's cache.
th: ถ้าบางอย่างดูไม่เปลี่ยนแปลง, โปรดลองล้างแคชดูก่อน. นี่จะเป็นการล้างแคชทั้งหมดเฉพาะปลั๊กอินนี้เท่านั้น.

source: Cache
th: แคช

source: Anti robots
th: ป้องกันบอต

source: Anti bot form will display the form field for user to fill and another form field for bot to fill.
th: ฟอร์มป้องกันบอตจะแสดงฟิลด์สำหรับผู้ใช้ให้กรอกและฟิลด์อื่นๆสำหรับบอต.

source: Do not use
th: ไม่ใช้

source: Default
th: ค่าเดิม

source: Use anti bot form field
th: ใช้ฟอร์มป้องกันบอต

source: Use anti bot form
th: ฟอร์มป้องกันบอต

source: User agent that contain text in one of this will be blocked. One per line, case insensitive.
th: User agent ที่มีข้อความหนึ่งในรายการเหล่านี้จะถูกบล็อค. หนึ่งข้อความต่อบรรทัด, ตัวอักษรเล็กใหญ่ไม่สำคัญ.

source: Block user agents
th: บล็อค user agents

source: Do not auto update
th: ไม่อัปเดทอัตโนมัติ

source: Every release
th: ทุกๆ release

source: Every release and commit
th: ทุกๆ release และ commit

source: Auto update
th: อัปเดทอัตโนมัติ

source: Logs/statistic
th: บันทึก/สถิติ

source: Check this to automatically delete old logs.
th: ติ๊กที่นี่เพื่อลบบันทึกเก่าอัตโนมัติ.

source: Default is yes.
th: ค่าเดิมคือใช่.

source: Auto delete logs
th: ลบบันทึกอัตโนมัติ

source: Auto delete logs after specific days. This will be skipped if %s was not checked.
th: ลบล็อกอัตโนมัติหลังจากวันที่ระบุ. สิ่งนี้จะไม่ทำงานถ้า %s ไม่ถูกติ๊ก.

source: Default is 90.
th: ค่าเดิมคือ 90.

source: Days limit
th: วันที่จำกัด

source: Check this to logs admin actions such as add, update, delete downloads.
th: ติ๊กที่นี่เพื่อบันทึกการกระทำของผู้ดูแล เช่น เพิ่ม, ลบ, ปรับปรุง, ดาวน์โหลด.

source: Admin actions
th: การกระทำผู้ดูแล

source: Design
th: ออกแบบ

source: Downloads element
th: HTML ที่จะแสดงผล

source: Basic guide
th: คำแนะนำพื้นฐาน

source: Add new download
th: เพิ่มดาวน์โหลดใหม่

source: Edit download
th: แก้ไขดาวน์โหลด

source: The editing item was not found.
th: ไม่พบรายการที่กำลังจะแก้ไข.

source: You do not have permission to edit other's downloads data.
th: คุณไม่มีสิทธิที่จะแก้ไขข้อมูลดาวน์โหลดของผู้อื่น.

source: Are you sure?
th: คุณแน่ใจหรือ?

source: If the selected file had linked with other downloads then it will show the error message.
th: ถ้าไฟล์ที่เลือกถูกเชื่อมโยงกับดาวน์โหลดอื่นๆ มันจะแสดงข้อความผิดพลาด.

source: This can not be un-done.
th: นี่จะไม่สามารถยกเลิกทำได้.

source: Dismiss
th: รับทราบ

source: Permissions
th: การอนุญาต

source: Please %1$sgo back%2$s and try again.
th: โปรด%1$sย้อนกลับไป%2$sแล้วลองอีกครั้ง.

source: Please %1$sdisconnect from GitHub OAuth%2$s and try again.
th: โปรด%1$sเลิกเชื่อมต่อกับ GitHub OAuth%2$sแล้วลองอีกครั้ง.

source: You have to sync the secret key with your GitHub repositories again to make the auto update works.
th: คุณจำเป็นต้องประสานข้อมูลกุญแจลับกับ repository ของ GitHub ของคุณทั้งหลายอีกครั้ง เพื่อให้อัปเดตอัตโนมัติทำงานได้.

source: Exists
th: มีอยู่

source: Not exists
th: ไม่มี

source: Re-generating the secret key, please wait.
th: กำลังสร้างกุญแจลับใหม่, โปรดรอสักครู่.

source: Synchronizing, please wait.
th: กำลังประสานข้อมูล, โปรดรอสักครู่.

source: Admin help
th: ช่วยเหลือผู้ดูแล

source: Download logs
th: บันทึกดาวน์โหลด

source: Logs
th: บันทึกประวัติ

source: All the logs will be cleared.
th: ล้างบันทึกทั้งหมดแล้ว.

source: Shortcodes
th: ช็อตโค้ด

source: The selected files will be deleted. GitHub and any remote files will be remain.
th: ไฟล์ที่เลือกจะถูกลบ. ไฟล์ที่ปลายทางบนเซิร์ฟเวอร์อื่นๆหรือ GitHub จะยังอยู่.

source: Downloads
th: ดาวน์โหลด

source: Add New
th: เพิ่มใหม่

source: Invalid form action, please try again.
th: การทำงานไม่ถูกต้อง, โปรดลองอีกครั้ง.

source: Success! All selected items have been deleted.
th: สำเร็จ! ลบรายการที่เลือกแล้ว.

source: There are some webhook that is unable to remove, here is the result.
th: มี webhook บางรายการที่ไม่สามารถเอาออกได้, นี่คือผลลัพธ์.

source: Warning! There are some problem about delete the items, here are the results.
th: คำเตือน! มีปัญหาบางอย่างเกี่ยวกับการลบรายการ, นี่คือผลลัพธ์.

source: Deleted item
th: รายการที่ลบแล้ว

source: Failed to delete item
th: ล้มเหลวในการลบรายการ

source: Failed to remove webhook on GitHub
th: ล้มเหลวในการเอา webhook ออกจาก GitHub

source: Capability limited item
th: รายการที่ติดขัดสิทธิ

source: Mismatch ID
th: ID ไม่ตรง

source: The selected items was not found.
th: ไม่พบรายการที่เลือก.

source: Success! All selected items have been updated.
th: สำเร็จ! อัปเดทรายการที่เลือกทั้งหมดแล้ว.

source: Warning! There are some problem about update the items, here are the results.
th: คำเตือน! มีปัญหาบางอย่างเกี่ยวกับการอัปเดทรายการ, นี่คือผลลัพธ์.

source: Updated item
th: รายการที่อัปเดทแล้ว

source: Failed to update item
th: รายการที่ล้มเหลวในการอัปเดท

source: The selected items was not found or not matched download type.
th: ไม่พบรายการที่เลือกหรือประเภทดาวน์โหลดไม่ตรงกัน.

source: Unable to delete file that is in system file (%s).
th: ไม่สามารถลบไฟล์ของระบบได้ (%s).

source: Unable to delete index file that is preventing directory browsing.
th: ไม่สามารถลบไฟล์ index ซึ่งป้องกันการเปิดดูโฟลเดอร์.

source: Unable to delete the selected file. The file is already in use. Please %1$sedit%2$s this downloads instead..
th: ไม่สามารถลบไฟล์ที่เลือก. ไฟล์กำลังถูกใช้งานอยู่. โปรด%1$sแก้ไข%2$sดาวน์โหลดนี้แทน.

source: The selected file was not found (%s).
th: ไม่พบไฟล์ที่เลือก (%s).

source: Unable to delete file that is not in %1$s folder (%2$s).
th: ไม่สามารถลบไฟล์ที่ไม่อยู่ในโฟลเดอร์ %1$s (%2$s).

source: Invalid URL.
th: URL ไม่ถูกต้อง.

source: Unable to process your request, please reload the page and try again.
th: ไม่สามารถดำเนินการประมวลผลได้, โปรดโหลดหน้านี้ใหม่แล้วลองอีกครั้ง.

source: Invalid GitHub repository URL. The correct format should be %s.
th: URL GitHub ไม่ถูกต้อง. รูปแบบที่ถูกต้องควรเป็น %s.

source: Unable to update secret key, please reload the page and try again.
th: ไม่สามารถอัปเดทกุญแจลับได้, โปรดโหลดหน้านี้ใหม่แล้วลองอีกครั้ง.

source: The secret key was updated successfully.
th: อัปเดทกุญแจลับสำเร็จแล้ว.

source: All logs were cleared.
th: ล้างบันทึกทั้งหมดแล้ว.

source: Incorrect Download URL value.
th: URL ดาวน์โหลดไม่ถูกต้อง.

source: Unknown error, please reload the webpage and try again.
th: ไม่ทราบข้อผิดพลาด, โปรดโหลดหน้านี้ใหม่แล้วลองอีกครั้ง.

source: Your download was saved successfully.
th: บันทึกดาวน์โหลดสำเร็จแล้ว.

source: Add a download
th: เพิ่มดาวน์โหลด

source: Any remote file
th: ไฟล์จากปลายทางใดๆ

source: GitHub file
th: ไฟล์บน GitHub

source: Local file
th: ไฟล์บนเซิร์ฟเวอร์

source: Unknown
th: ไม่ทราบ

source: Download Statistics
th: สถิติดาวน์โหลด

source: Getting data, please wait.
th: กำลังดึงข้อมูล, โปรดรอสักครู่.

source: There are no data.
th: ไม่มีข้อมูล.

source: Total downloads
th: ดาวน์โหลดทั้งหมด

source: Total errors
th: ผิดพลาดทั้งหมด

source: Total failed on anti robot
th: ล้มเหลวในการตรวจสอบป้องกันบอต

source: Rundiz Downloads shortcodes
th: ช็อตโค้ดต่างๆ

source: DB version %s
th: รุ่นฐานข้อมูล %s

source: You are using PHP %1$s which does not meet minimum requirement. Please consider upgrade PHP version or contact plugin author for this help.<br><br>Minimum requirement:<br>PHP %2$s
th: คุณกำลังใช้ PHP %1$s ซึ่งไม่ตรงความต้องการขั้นต่ำ. โปรดตัดสินใจอัปเกรดรุ่น PHP หรือติดต่อผู้เขียนปลั๊กอินเพื่อขอความช่วยเหลือ.<br><br>ความต้องการขั้นต่ำ:<br>PHP %2$s

source: Minimum requirement of PHP version does not meet.
th: รุ่น PHP ที่ใช้ไม่ตรงตามความต้องการขั้นต่ำ.

source: Your WordPress version does not meet the requirement. (%1$s < %2$s).
th: รุ่นเวิร์ดเพรสของคุณไม่ตรงตามความต้องการขั้นต่ำ. (%1$s < %2$s).

source: Unable to network activate, please activate from each site that have to use it only.
th: ไม่สามารถเปิดใช้งานแบบเน็ตเวิร์คได้, โปรดเปิดใช้งานจากแต่ละเว็บไซต์ที่ต้องใช้เท่านั้น.

source: Please reload this page and try again.
th: โปรดโหลดหน้านี้ใหม่แล้วลองอีกครั้ง.

source: An error has been occur, cannot continue manual update. Please contact plugin author.
th: มีข้อผิดพลาดเกิดขึ้น, ไม่สามารถดำเนินการอัปเดทด้วยตนเองได้. โปรดติดต่อผู้เขียนปลั๊กอิน.

source: Success, please click next to continue update.
th: สำเร็จ, โปรดคลิกที่ปุ่ม ถัดไป เพื่อดำเนินการอัปเดทต่อ.

source: All manual update completed successfully. This page will be no longer available until there is next manual update.
th: อัปเดททั้งหมดสำเร็จแล้ว. หน้านี้จะไม่สามารถเข้าถึงได้อีกจนกว่าจะมีการต้องอัปเดทด้วยตนเองในครั้งต่อไป.

source: Unable to run update, there is no update classes to run.
th: ไม่สามารถทำการอัปเดทได้, ไม่มีคลาสที่จะทำงาน.

source: The Rundiz Downloads is just upgraded and need to be manually update. Please continue to the %1$splugin update page%2$s.
th: Rundiz Downloads เพิ่งถูกปรับรุ่นและต้องการการอัปเดทด้วยตนเอง. โปรดดำเนินการต่อไปยัง%1$sหน้าอัปเดทปลั๊กอิน%2$s.

source: Completed
th: เรียบร้อยแล้ว

source: Next
th: ถัดไป

source: Downloads Settings
th: ตั้งค่าดาวน์โหลด

source: Settings
th: ตั้งค่า

source: The manual update is required, please %1$supdate first%2$s.
th: จำเป็นต้องดำเนินการอัปเดทด้วยตนเอง, โปรด %1$sทำการอัปเดทก่อน%2$s.

source: The manual update is required, please tell administrator to update first.
th: จำเป็นต้องดำเนินการอัปเดทด้วยตนเอง, โปรดติดต่อผู้ดูแลเพื่อดำเนินการอัปเดทก่อน.

source: You are not authorized to download the file. Failed to set required cookie.
th: คุณไม่ได้รับอนุญาตให้ดาวน์โหลดไฟล์. ล้มเหลวในการกำหนดคุกกี้.

source: You are not authorized to download the file. Failed to validate human.
th: คุณไม่ได้รับอนุญาตให้ดาวน์โหลดไฟล์. ล้มเหลวในการตรวจสอบความเป็นมนุษย์.

source: Method not allowed.
th: ไม่อนุญาตให้ใช้เมธอดนี้.

source: Please reload the page and try again.
th: โปรดโหลดหน้านี้ใหม่แล้วลองอีกครั้ง.

source: The %s must be string.
th: %s ต้องเป็นสตริง.

source: Download
th: ดาวน์โหลด

source: Downloads name
th: ชื่อดาวน์โหลด

source: GitHub repository name
th: ชื่อ repository ของ GitHub

source: Size
th: ขนาด

source: File name
th: ชื่อไฟล์

source: File size
th: ขนาดไฟล์

source: Create on
th: สร้างเมื่อ

source: Last update
th: อัปเดทล่าสุด

source: Total download
th: ดาวน์โหลดทั้งหมด

source: Version
th: รุ่น

source: The template file was not found. (%s)
th: ไม่พบไฟล์เทมเพลท. (%s)

source: The views file was not found (%s).
th: ไม่พบไฟล์ views (%s).

source: Upload
th: อัปโหลด

source: Remove
th: เอาออก

source: Required attribute for display link to download.
th: แอตทริบิวท์ที่ต้องการเพื่อแสดงลิ้งค์ไปยังดาวน์โหลด.

source: Set to %s to display file size. Default is not set.
th: กำหนดเป็น %s เพื่อแสดงขนาดไฟล์. ค่าเดิมคือไม่กำหนด.

source: Set to %s to display file name. Default is not set.
th: กำหนดเป็น %s เพื่อแสดงชื่อไฟล์. ค่าเดิมคือไม่กำหนด.

source: Set to %s to display download count. Default is not set.
th: กำหนดเป็น %s เพื่อแสดงจำนวนดาวน์โหลด. ค่าเดิมคือไม่กำหนด.

source: Set to %s to display download file version. Default is not set.
th: กำหนดเป็น %s เพื่อแสดงรุ่นของไฟล์. ค่าเดิมคือไม่กำหนด.

source: Set to %s to display create date. Default is not set.
th: กำหนดเป็น %s เพื่อแสดงวันที่สร้าง. ค่าเดิมคือไม่กำหนด.

source: Set to %s to display last update. Default is not set.
th: กำหนดเป็น %s เพื่อแสดงวันที่อัปเดทล่าสุด. ค่าเดิมคือไม่กำหนด.

source: Use %1$sPHP date/time format%2$s. Default is %3$s.
th: ใช้รูปแบบวันที่ %1$sPHP %2$s. ค่าเดิมคือ %3$s.

source: No
th: ไม่

source: Check this.
th: ตรวจสอบ.

source: Repository name
th: ชื่อ repository

source: Archived
th: เก็บถาวร

source: Unknow
th: ไม่ทราบ

source: Admin add new item
th: ผู้ดูแลเพิ่มรายการใหม่

source: Admin update an item
th: ผู้ดูแลปรับปรุงรายการ

source: Admin delete an item
th: ผู้ดูแลลบรายการ

source: Admin clear logs
th: ผู้ดูแลล้างบันทึก

source: Auto purge old logs
th: ล้างบันทึกเก่าอัตโนมัติ

source: GitHub auto update
th: อัปเดตอัตโนมัติจาก GitHub

source: User download success
th: ผู้ใช้ดาวน์โหลดสำเร็จ

source: User download failed
th: ผู้ใช้ล้มเหลวในการดาวน์โหลด

source: User download banned
th: ผู้ใช้ถูกแบน

source: User enter wrong captcha code
th: ผู้ใช้กรอกแคปต์ชาผิด

source: User has failed to verify antibot
th: ผู้ใช้ล้มเหลวในการตรวจสอบป้องกันบอต

source: Clear
th: ล้างค่า

source: User
th: ผู้ใช้

source: Status
th: สถานะ

source: IP Address
th: หมายเลขไอพี

source: Date
th: วันที่

source: All
th: ทั้งหมด

source: Filtered user: %s
th: กรองผู้ใช้: %s

source: Reset filtered user
th: ล้างค่ากรองผู้ใช้

source: Filtered download: %s
th: กรองดาวน์โหลด: %s

source: Reset filtered download
th: ล้างค่ากรองดาวน์โหลด

source: Filter download
th: กรองดาวน์โหลด

source: Filter user
th: กรองผู้ใช้

source: Shortcode copied to clipboard.
th: คัดลอกช็อตโค้ดไปยังคลิปบอร์ดแล้ว.

source: Created: %s
th: สร้างเมื่อ: %s

source: Updated: %s
th: อัปเดท: %s

source: Version %s
th: รุ่น %s

source: Update GitHub
th: อัปเดท GitHub

source: Update remote file
th: อัปเดทไฟล์จากปลายทาง

source: Delete
th: ลบ

source: Author
th: ผู้เขียน

source: Type
th: ประเภท

source: File
th: ไฟล์

source: Shortcode
th: ช็อตโค้ด

source: Download count
th: นับดาวน์โหลด

source: Preview
th: ดูก่อน

source: GitHub repository
th: ชื่อ repository ของ GitHub

source: To save the downloads data, the Download URL field is required.
th: การบันทึกข้อมูลดาวน์โหลด ช่อง URL จะต้องกรอก.

source: You can upload a file to the server using upload button below. You can also use FTP for large file size by uploading it to %s and then use file browser below to select the file.
th: คุณสามารถอัพโหลดไฟล์ไว้บนเซิร์ฟเวอร์โดยใช้ปุ่มอัปโหลดด้านล่าง. คุณสามารถใช้ FTP สำหรับไฟล์ใหญ่ๆ โดยอัปโหลดไปที่ %s จากนั้นจึงใช้ไฟล์เบราเซอร์ด้านล่างเพื่อเลือกไฟล์.

source: If you will be uploading the files using FTP, the file name should be web safe. For example: English, number, dash(-), underscore (_), no anything else.
th: ถ้าคุณจะอัปโหลดไฟล์โดย FTP, ชื่อไฟล์ควรปลอดภัยสำหรับเว็บ. ตัวอย่างเช่น: อักขระภาษาอังกฤษ, ตัวเลข, ขีดกลาง (-), ขีดล่าง (_), ไม่ควรใช้อย่างอื่น.

source: You can enter the download URL in the Download URL field directly by using one of these URL formats.
th: คุณสามาถกรอก URL สำหรับดาวน์โหลดในช่อง URL ได้โดยตรง โดยใช้รูปแบบ URL เหล่านี้.

source: Users cannot use auto correct GitHub URL if they don't connect to GitHub OAuth.
th: ผู้ใช้จะไม่สามารถใช้การแก้ไข URL ของ GitHub อย่างอัตโนมัติได้ถ้าพวกเขาไม่ได้เชื่อมต่อกับ GitHub OAuth.

source: You can enter the download URL in the Download URL field directly for any remotely hosted file.
th: คุณสามาถกรอก URL สำหรับดาวน์โหลดในช่อง URL ได้โดยตรงสำหรับไฟล์ที่อยู่บนเซิร์ฟเวอร์อื่นๆ.

source: The Force download option will work with the local file only.
th: ตัวเลือกบังคับดาวน์โหลดจะทำงานกับไฟล์บนเซิร์ฟเวอร์เท่านั้น.

source: If you want to use redirect, the %s option in plugin setting page must be unchecked.
th: ถ้าคุณต้องการใช้เปลี่ยนเส้นทาง, ตัวเลือก %s ในหน้าตั้งค่าปลั๊กอินจะต้องไม่ถูกติ๊ก.

source: If you choose this option to default, it will use %s option from plugin setting page.
th: ถ้าคุณเลือกค่านี้เป็นค่าเดิม, มันจะใช้ตัวเลือก %s จากหน้าตั้งค่าปลั๊กอิน.

source: redirect to file
th: เปลี่ยนเส้นทางไปยังไฟล์

source: The plugin setting is using %s.
th: ตั้งค่าปลั๊กอินใช้ %s.

source: Download URL
th: URL ดาวน์โหลด

source: Please open the help tab to see help message.
th: โปรดเปิดแท็บช่วยเหลือเพื่อดูข้อความช่วยเหลือ.

source: Upload new file
th: อัปโหลดไฟล์ใหม่

source: Reload
th: โหลดใหม่

source: Maximum upload file size: %s.
th: ขนาดไฟล์สูงสุด: %s.

source: The version number of this download. Example: %s
th: หมายเลขรุ่นของไฟล์ดาวน์โหลดนี้. ตัวอย่าง: %s

source: Version range
th: ระยะของรุ่น

source: The version range to get update.
th: ขอบเขตระยะของรุ่นที่จะรับการอัปเดต.

source: We use the same versions and constraints as %1$scomposer%2$s.
th: เราใช้การเทียบเลขรุ่นและขีดจำกัด แบบเดียวกับใน %1$scomposer%2$s.

source: Default is %s
th: ค่าเดิมคือ %s

source: This is for GitHub download only.
th: นี่สำหรับไฟล์ดาวน์โหลดบน GitHub เท่านั้น.

source: Notes
th: บันทึก

source: Notes about this download, display to administrator only. HTML will be escaped.
th: บันทึกเกี่ยวกับดาวน์โหลดนี้, แสดงสำหรับผู้ดูแลเท่านั้น. HTML จะถูกแปลง.

source: The number of times this file has been downloaded.
th: จำนวนครั้งที่ไฟล์นี้ถูกดาวน์โหลด.

source: Choose yes and the file will use force download instead of redirect to it.
th: เลือก ใช่ แล้วไฟล์จะถูกบังคับดาวน์โหลดแทนเปลี่ยนเส้นทาง.

source: Publish data
th: เผยแพร่ข้อมูล

source: Created by
th: สร้างโดย

source: Created on
th: สร้างเมื่อ

source: Save
th: บันทึก

source: This file is linked with other downloads data.
th: ไฟล์นี้ถูกใช้โดยข้อมูลดาวน์โหลดอื่นๆ.

source: Delete this file
th: ลบไฟล์นี้

source: Users who are able to access this page must have permission to manage downloads.
th: ผู้ใช้ที่ต้องการจะเข้าถึงหน้านี้จะต้องมีสิทธิ์ในการจัดการดาวน์โหลด.

source: To manage downloads (including add or edit downloads), user require %s capability.
th: การจัดการดาวน์โหลด (รวมถึงการเพิ่ม, แก้ไข), ผู้ใช้จะต้องมีความสามารถ %s.

source: For more information about these capabilities, please continue reading on %1$sWordPress%2$s website.
th: สำหรับข้อมูลเพิ่มเติมเกี่ยวกับความสามารถเหล่านี้, โปรดอ่านได้ที่เว็บไซต์ของ %1$sWordPress%2$s.

source: To sync secret key with GitHub, by default if this website is using %1$s then the %2$s will be enable by default.
th: การประสานกุญแจลับกับ GitHub, โดยค่าเดิม ถ้าเว็บไซต์ใช้งาน %1$s ดังนั้น %2$s จะเปิดใช้งานให้เอง.

source: To disable it, you have to go to your repository setting on GitHub and change this setting or use %1$s filter and change value to %2$s (string) and then sync again.
th: การปิดใช้งาน, คุณต้องไปยังหน้าตั้งค่าของ repository บน GitHub แล้วเปลี่ยนการตั้งค่านี้หรือใช้ฟิลเตอร์ %1$s แล้วเปลี่ยนค่าเป็น %2$s (สตริง) แล้วประสานข้อมูลอีกครั้ง.

source: You are not connected with GitHub. To make auto update, auto correct repository URL works you have to connect to GitHub.
th: คุณยังไม่ได้เชื่อมต่อกับ GitHub. การอัปเดตอัตโนมัติ, แก้ไข URL อัตโนมัติ จะทำงานได้ คุณต้องเชื่อมต่อไปยัง GitHub.

source: Connect with GitHub
th: เชื่อมต่อไปยัง GitHub

source: You had connected to GitHub as %s.
th: คุณได้เชื่อมต่อกับ GitHub เป็น %s.

source: Disconnect from GitHub
th: เลิกการเชื่อมต่อกับ GitHub

source: Your secret key to use with GitHub auto update
th: กุญแจลับของคุณที่จะใช้กับการอัปเดตอันโตมัติจาก GitHub

source: Show/Hide
th: แสดง/ซ่อน

source: Re-generate secret
th: สร้างกุญแจลับใหม่

source: This will be force synchronize secret with your GitHub repositories.
th: นี่จะบังคับให้ประสานกุญแจลับกับ repository ของ GitHub ของคุณ.

source: Force sync secret on GitHub.
th: บังคับให้ประสานกุญแจลับบน GitHub.

source: The list above was cached. To retreive the latest list, please clear the cache.
th: รายการด้านบนถูกแคช. การจะดึงรายการใหม่ โปรดล้างแคช.

source: Are you sure to disconnect?
th: คุณแน่ใจที่จะเลิกการเชื่อมต่อหรือไม่?

source: You can connect again at anytime.
th: คุณสามารถเชื่อมต่ออีกครั้งเมื่อใดก็ได้.

source: Confirm disconnect
th: ยืนยันเลิกการเชื่อมต่อ

source: You has beed disconnected from GitHub. %1$sGo back%2$s to connect page.
th: คุณเลิกการเชื่อมต่อกับ GitHub แล้ว. %1$sย้อนกลับ%2$sไปยังหน้าเชื่อมต่อ.
